app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post1"], ["body", "Test post "], ["created_at", 2017-04-19 07:36:31 UTC], ["updated_at", 2017-04-19 07:36:31 UTC]]
---
  def create
    #render plain: params[:post].inspect
    @Post = Post.new(post_params)

    if(@Post.save)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Post12"], ["updated_at", 2017-04-19 09:39:29 UTC], ["id", 1]]
---
  def update
    @Post = Post.find(params[:id])
    if(@Post.update(post_params))